[{
  "_id": {
    "$oid": "617fcc6abd52d3bdf750ec75"
  },
  "name": "Vitamin A",
  "plants": "Carrot,Sweet Potato,Mango,Papaya,Tomatoes",
  "function": "Need for vision and eye health,Maintain skin health,Boosts immune system,Vital for fedrtility and fetal developement",
  "deficiency": "dry skin,infertility,delayed growth,throat and chest pain",
  "what": "Vitamin A is a fat-soluble nutrient that plays a vital role in your body.It exists naturally in the foods you eat and can also be consumed through supplements. vitamin A is often considered a singular nutrient, it’s really the name for a group of fat-soluble compounds, including retinol, retinal and retinyl esters.",
  "fun": "Vitamin A is essential for your health, supporting cell growth, immune function, fetal development and vision.Perhaps one of the best-known functions of vitamin A is its role in vision and eye health.Retinal, the active form of vitamin A, combines with the protein opsin to form rhodopsin, a molecule necessary for color vision and low-light vision.It also helps protect and maintain the cornea-the outermost layer of your eye-and the conjunctiva-a thin membrane that covers the surface of your eye and inside of your eyelidsAdditionally, vitamin A helps maintain surface tissues such as your skin, intestines, lungs, bladder and inner ear.It supports immune function by supporting the growth and distribution of T-cells, a type of white blood cell that protects your body from infection.",
  "health": "Provitamin A carotenoids such as beta-carotene, alpha-carotene and beta-cryptoxanthin are precursors of vitamin A and have antioxidant properties.Carotenoids fight free radicals-highly reactive molecules that can harm your body by creating oxidative stress.Oxidative stress has been linked to various chronic illnesses like diabetes, cancer, heart disease and cognitive decline.Diets high in carotenoids are associated with a lower risk of many of these conditions, such as heart disease, lung cancer and diabetes.Essential for Eye Health and Prevents Macular DegenerationAdequate dietary intake of vitamin A helps protect against certain eye diseases, such as age-related macular degeneration (AMD).Studies show that higher blood levels of beta-carotene, alpha-carotene and beta-cryptoxanthin may reduce your risk of AMD by up to 25%.Due to their antioxidant properties, carotenoid-rich fruits and vegetables may protect against certain types of cancer.Vitamin A is essential for both male and female reproduction because it plays a role in sperm and egg development.Vitamin A impacts immune health by stimulating responses that protect your body from illnesses and infections.Vitamin A is involved in the creation of certain cells, including B-and T-cells, which play central roles in immune responses that guard against disease.",
  "defi": "Though vitamin A deficiency is rare in developed countries like the US, it’s common in developing countries, as these populations may have limited access to food sources of preformed vitamin A and provitamin A carotenoids.Vitamin A deficiency also increases the severity and risk of dying from infections like measles and diarrhea.vitamin A deficiency raises the risk of anemia and death in pregnant women and negatively impacts the fetus by slowing growth and development.Less severe symptoms of vitamin A deficiency include skin issues like hyperkeratosis and acne.",
  "food": "Egg yolks,Beef liver,Liverwurst,ButterCod liver,oilChicken,liverSalmonCheddar,cheeseLiver,sausageKing mackerel,Sweet potatoes,Pumpkin,Carrot,Spinach,greens,Cabbage,squash."
}]